---
type: RadioButtonGroup
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# RadioButtonGroup

`Autodesk.Revit.UI.RadioButtonGroup` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddItem | 2011 | `public ToggleButton AddItem ( ToggleButtonData buttonData )` |
| Method | AddItems | 2011 | `public IList < ToggleButton > AddItems ( IList < ToggleButtonData > buttonData )` |
| Method | GetItems | 2011 | `public IList < ToggleButton > GetItems ()` |
| Property | Current | 2011 | `public ToggleButton Current { get ; set ; }` |